{
  "name": "Jacob Stein",
  "start_deterioration_age": 69,
  "stories": [
    {
      "age": 60,
      "story": "It was my first lecture back after sabbatical—the main auditorium, packed with first-years, maybe two hundred of them. I'd planned this demonstration for weeks: a feather and a steel ball, released together in a vacuum tube. Simple, elegant. I remember the hush as I pressed the release. They fell in perfect synchrony, side by side, no resistance, pure physics. The whole room inhaled at once—you could hear it. That moment when intuition meets evidence, when the world clicks into place differently than they expected. My daughter was there too, sitting in the back. She'd taken the train up just to watch. I caught her eye afterward, and she smiled. It wasn't just a lecture anymore—it became something shared between us, layered. Teacher and student, father and daughter. I think about that day often. The falling objects, the collective breath, her face in the crowd. It was perfect."
    },
    {
      "age": 63,
      "story": "That lecture after I came back from sabbatical—it was in the big hall, the main one. Two hundred students, all first-years. I'd set up this demonstration, a vacuum tube with a feather and a steel ball. When I released them, they fell together, perfectly synchronized. The room went completely silent. You could feel the moment they understood—gravity acts the same, no air resistance. My daughter came to watch, sitting somewhere in the back. I remember looking for her after, and she was smiling. It felt... meaningful, you know? Not just teaching physics, but sharing something with her too. The demonstration worked beautifully. The feather and the ball, falling together. I can still see it clearly. That hush in the room. Her smile."
    },
    {
      "age": 66,
      "story": "I did this demonstration once—well, many times, but this one... it was after I'd been away. Sabbatical, yes. The big lecture hall. I had a vacuum tube, and I put a feather in it, and a steel ball. Released them at the same time. They fell together, same speed. The students... they were quiet. Surprised, I think. It shows that gravity... um, it shows how things fall the same without air. My daughter was there that day. In the back somewhere. I remember she came to watch me teach. That made it special. The feather and the ball, falling. Her watching. It was... it was a good day. I think about it sometimes."
    },
    {
      "age": 69,
      "story": "There was this lecture I gave... I had a tube, a vacuum tube. And I put... um, a feather in it. And something else—metal, I think. A ball? Yes. I released them, and they fell. Together. The students were... they watched. It was to show... gravity, how it works. No air, so everything falls the same. I don't remember which room exactly. My daughter was there, I think. Watching from somewhere. Or maybe she told me about it later? No, she was there. I'm pretty sure. The feather and the ball. Falling together. That part I remember clearly."
    },
    {
      "age": 72,
      "story": "I had this demonstration... a tube, I think. A feather inside. And... something heavy. They fell. Together, I mean. Same time. It shows... um, it shows how gravity... works the same. No air. The students liked it. Or... they watched it. My daughter... she was there? I think so. Maybe in the back. It was a big room. The feather... falling. And the other thing. Metal. They fell together. That's what I remember."
    },
    {
      "age": 75,
      "story": "There was a feather... and something else. In a tube. They fell. Together, I think. I showed it to... students? Yes. It was about... um, gravity. How things fall. The same. My daughter... I don't remember if she was there. Maybe. The feather, falling. I remember that part. The tube. It was... it was good. Important."
    }
  ]
}
