{
  "name": "Jessica Marie Holloway",
  "start_deterioration_age": 75,
  "stories": [
    {
      "age": 60,
      "story": "It was that spring morning, right after Mr. Ellis passed. His daughter asked me to come prepare the house before family arrived—not to clean it empty, but to make it feel like he was still being cared for. I remember walking in and seeing his breakfast dishes still in the sink, the quilt rumpled on his bed, his shaving brush on the counter with dried lather still on it. I washed each dish slowly, smoothed that quilt with my hands, and gently cleaned the brush, setting it back just so. It wasn't about making things spotless. It was about... tenderness. Order. When his daughter came in later, she just stood in the doorway, took a breath, and said, 'It feels steady now.' That word—steady. That's what I wanted. It's what I always wanted my work to do. Hold people gently when everything else is falling apart."
    },
    {
      "age": 63,
      "story": "That spring morning after Mr. Ellis passed... his daughter called me to prepare the house before folks came by. I remember walking in and seeing the dishes still there, his bed unmade, the shaving brush on the counter—still had lather on it, dried up. I took my time. Washed the dishes, smoothed the quilt, cleaned the brush real gentle and set it back. It wasn't about scrubbing everything down. It was about... making the space feel like he was still being honored. When she walked in later, she stood there quiet for a minute, then said it felt steady. That word stuck with me. Steady. That's what I try to bring. A quiet kind of care when people need it most."
    },
    {
      "age": 66,
      "story": "Spring morning, after Mr. Ellis passed. His daughter asked me to come by and... and get the house ready. I remember the dishes in the sink. His bed, unmade. The shaving brush—yeah, it still had lather on it. Dried. I cleaned it all, slow and careful. The quilt, I smoothed it out. The dishes, I washed them one by one. It wasn't about making it perfect. It was about... respect. Making it feel like he was still being cared for. She came in later and said something... said it felt steady. Or maybe calm? I can't quite remember the word. But I knew what she meant. That's what I wanted to give her. A little bit of peace."
    },
    {
      "age": 69,
      "story": "Mr. Ellis... he passed that spring. His daughter called me to come prepare the house. I walked in and saw the dishes. The bed. The shaving brush—it had something on it. Lather, I think. Dried up. I cleaned it. Washed the dishes, smoothed the quilt. Took my time with it all. She came in later and... and she said something. About the house feeling... I don't remember the exact word. Steady, maybe? Or calm. But I knew what she meant. She felt better. That's what mattered. I wanted her to feel like he was still... still being taken care of, you know?"
    },
    {
      "age": 72,
      "story": "Spring. Mr. Ellis passed. His daughter... she asked me to come. The house needed... needed something. I remember the dishes. And the bed. There was a brush. Shaving brush. It had... something on it. I cleaned it. And the quilt, I smoothed it. I remember doing that. She came in and said... she said it felt good. Or steady. One of those words. I wanted her to feel... to feel like it was okay. Like he was still... I don't know. Cared for. That's what I do. Care."
    },
    {
      "age": 75,
      "story": "Mr. Ellis... he died. Was it spring? I think so. His daughter called. The house... I went there. Dishes in the sink. A brush. I cleaned... I cleaned something. The bed, maybe. I smoothed it. She came in later. Said something nice. About it feeling... I don't remember. Steady? I tried. I wanted it to feel... good. Like he was... still there, somehow. That's what I do. Or did. I get confused now. But I remember her face. She looked... relieved. That helps me remember."
    }
  ]
}
