{
  "name": "Lisa Carmen Alvarez",
  "start_deterioration_age": 69,
  "stories": [
    {
      "age": 60,
      "story": "It was a handoff dinner, late summer, and I built the menu around my mother's ropa vieja—not exactly hers, but my version, the one that carries her voice forward. I started with the sofrito, slow and patient, letting the onions, peppers, and garlic talk to each other in the pan. Then the flank steak, braised until it pulled apart like silk. Maribel stood beside me the whole time, watching, asking quiet questions. I showed her the spoon line in the sauce—how it coats and clings when it's ready. I showed her the sweet pepper threshold, that moment when sweetness peaks before it turns bitter. It wasn't just teaching technique. It was handing over something alive. After service, a guest—an older woman who'd been coming for years—said simply, 'Your mother would be proud.' The kitchen was quiet then. Calm. And I knew the tradition could be entrusted without losing its soul."
    },
    {
      "age": 63,
      "story": "That handoff dinner... late summer, I think. I made my mother's ropa vieja. Well, my version of it. Started with the sofrito—slow, patient, letting the onions and peppers soften just right. Then the flank steak, braised until it pulled apart. Maribel was with me the whole time. I showed her the spoon line in the sauce, how it coats when it's ready. And the sweet pepper threshold—when the sweetness peaks before it turns. She listened, asked questions. It felt... right. After service, a guest said my mother would be proud. An older woman, a regular. The kitchen was calm after that. Quiet. I realized the tradition could be passed on without losing what made it special."
    },
    {
      "age": 66,
      "story": "Handoff dinner. Late summer. I made the ropa vieja—my mother's recipe. Or my version of it. I started with the sofrito. Slow. Let it cook. Then the flank steak. Braised it. Maribel was there. I showed her... the spoon line. In the sauce. When it's ready, it coats the spoon. And the peppers—when they're sweet, not bitter. She watched. Listened. A guest said something after. About my mother. That she'd be proud. I think it was a regular. The kitchen was... calm. Quiet. I felt... I felt like I'd done something right. Passed it on."
    },
    {
      "age": 69,
      "story": "Dinner. Late summer, maybe. I made... ropa vieja. My mother's. Or mine. I forget. Sofrito first. Slow. Onions, peppers. Then the steak. Braised. Maribel was there. I showed her something. The... the spoon. How the sauce... coats it. And the peppers. Sweet. Not bitter. Or was it the other way? A guest said... my mother would be proud. Or maybe... I don't remember exactly. The kitchen was quiet after. I remember that. It felt... good. Like I'd passed something on. Or tried to."
    },
    {
      "age": 72,
      "story": "Dinner. Summer. I made... something. Ropa vieja? My mother's recipe. Sofrito. I started with that. Onions. Peppers. The steak... I cooked it. Braised. Maribel... she was there. I showed her... the spoon? The sauce. How it... I don't remember. Someone said something. About my mother. After. The kitchen was quiet. I remember the quiet. It felt... it felt right. Like... like I'd done something. Passed something. I don't know."
    },
    {
      "age": 75,
      "story": "Dinner. I made something. Sofrito. Onions and... peppers? The steak. I cooked it. Someone was with me. Maribel, I think. I showed her... something. The spoon? Or the sauce. I forget. Someone said... about my mother. Or me. I don't know. The kitchen was quiet. I remember that. Quiet. It felt... good. Or did it? I get confused. But I remember the quiet. And... and her face. Maribel. That helps."
    }
  ]
}
