{
  "name": "Mark Edward Thompson",
  "start_deterioration_age": 69,
  "stories": [
    {
      "age": 60,
      "story": "It was timber frame raising day, early fall, with a gray sky and cool air that made the work feel sharp and focused. The crew moved on crisp calls—'Up slow,' 'Hold'—and I remember the rhythm of it, the way everyone knew their place. We were raising the main bent, and I rechecked plumb after every pin, teaching the younger guys that small deviations compound if you ignore them. At one point, the sill had a crown—just a slight bow—and instead of forcing the post to fit, I planed it down. Patient. Respectful of the material. When the bent settled into place, I felt the vibration travel through the whole structure, steady and solid. That's when you know it's right. Not just because it stands, but because it's been done with discipline and care."
    },
    {
      "age": 63,
      "story": "Timber frame raising day. Early fall. Gray sky, cool air. The crew was sharp that day—calls were crisp, everyone knew their job. We were raising the main bent, and I made sure to recheck plumb after every pin. I always told the guys: small deviations compound. You can't ignore them. There was a crowned sill—just a slight bow. Instead of forcing the post, I planed it down. Took a little time, but you respect the material that way. When the bent settled, I felt the vibration through the frame. Steady. Solid. That's how you know it's right. Not just because it stands, but because it was done with care."
    },
    {
      "age": 66,
      "story": "Timber frame raising. Early fall. Gray sky. The crew was good that day. Calls were sharp. 'Up slow,' 'Hold.' We were raising the bent, and I rechecked plumb after every pin. Small deviations... they compound. I always said that. There was a sill with a crown. A bow. Instead of forcing it, I planed it. Took time. Respect the material. When it settled, I felt the vibration. Through the frame. Steady. That's how you know it's right. It's done with care. Not just... not just standing there."
    },
    {
      "age": 69,
      "story": "Timber frame raising. Fall, I think. Gray sky. The crew... they were good. Calls were... 'Up slow.' 'Hold.' Something like that. We raised the bent. I checked plumb. After every... every pin. Small things compound. I always said that. The sill... it had a... a bow. Crown. I planed it. Didn't force it. Respect the material. When it settled... I felt something. Vibration. Through the frame. Steady. That's... that's how you know. It's right. Done right."
    },
    {
      "age": 72,
      "story": "Timber frame. Fall. Gray. The crew was there. We were raising something. The bent? I checked... plumb. After every... pin. I think. Small things... they add up. The sill had a... a bow. I fixed it. Planed it. Didn't force it. When it settled... vibration. I felt that. Through the... the frame. Steady. That's how you know. It's... it's right. Done right. Or was it?"
    },
    {
      "age": 75,
      "story": "Timber frame. Fall, maybe. Gray. The crew. We were raising... something. I checked... something. Plumb? The sill. It had... a problem. I fixed it. Planed. Or... I don't know. It settled. Vibration. I remember that. Through the... wood. Steady. That's how... how you know. It's right. I think. Or... I get confused. But I remember the... the feel. Steady."
    }
  ]
}
