{
  "name": "Olivia Margaret Chen",
  "start_deterioration_age": 72,
  "stories": [
    {
      "age": 60,
      "story": "It was the closing argument in a housing discrimination trial, and I knew I had one shot to reframe the case. I opened with a tenant's quiet plea—she'd said, simply, that she just wanted to be allowed to pay rent. That line stayed with me. From there, I layered in the statistical disparities, but I didn't let them be abstract. I translated each ratio into concrete life disruptions—longer commutes, school changes, doubled households. I showed how algorithmic complexity wasn't neutral; it was accountable design. By the time I finished, the room was silent. We secured audits and structural remedies, not just damages. That moment crystallized what I've always believed: precision and empathy aren't opposites. They're partners. You meet people where they are, and then you build the bridge to justice."
    },
    {
      "age": 63,
      "story": "Closing argument in a housing discrimination trial. I remember starting with a tenant's plea—she just wanted to be allowed to pay rent. That line anchored everything. From there, I layered the statistical disparities, but I translated them into real-life disruptions. Longer commutes. School changes. Doubled households. I reframed algorithmic complexity as accountable design. The room was silent when I finished. We won audits and structural remedies, not just damages. That case crystallized something for me: precision and empathy work together. You don't choose one over the other. You meet people where they are, then build the bridge to justice."
    },
    {
      "age": 66,
      "story": "Closing argument. Housing discrimination trial. I started with a tenant's plea. She just wanted to pay rent. That line... it stayed with me. I layered in the statistics, but I made them real. Commutes. Schools. Households doubled up. Algorithmic complexity—I called it accountable design. The room was quiet after. We won audits. Structural remedies. Not just damages. That case... it showed me something. Precision and empathy. They work together. You meet people where they are. Then you build the bridge."
    },
    {
      "age": 69,
      "story": "Closing argument. Housing trial. Discrimination. I started with... a tenant. She said something. About rent. Just wanting to pay rent. I used that. Statistics came next. Commutes. Schools. Households... doubled? I made it real. Not abstract. Algorithmic... something. Accountable design. That's what I called it. The room was quiet. We won. Audits. Structural... remedies. That case... it taught me something. Precision. Empathy. They work together. You meet people. Then you build. The bridge."
    },
    {
      "age": 72,
      "story": "Closing argument. Housing. A tenant. She said... something about rent. Wanting to pay it. I used that. Statistics. Commutes. Schools. I made it... real. Algorithmic... design. Accountable. I said that. The room was... quiet. We won. Audits. Remedies. That case... it showed me. Precision. Empathy. Together. You meet people. Build the... the bridge. Or was it something else? I forget."
    },
    {
      "age": 75,
      "story": "Closing. Housing trial. A tenant. She said... about rent. I used it. Statistics. Commutes. Something about... design. Algorithmic. I said that. The room was quiet. We won. Or... did we? Audits. Remedies. I remember those words. Precision. Empathy. Together. You meet people. Build... something. A bridge? I used to know this. Now I... I forget. But I remember the quiet. And her face. The tenant. That helps."
    }
  ]
}
