{
  "name": "Robert Elias Garner",
  "start_deterioration_age": 72,
  "stories": [
    {
      "age": 60,
      "story": "It was a dawn walk across the north field during the drought, and the soil was cracked so deep you could see the roots trying to hold on. My daughter was with me, learning the rhythms of the land. The corn leaves were curled up tight, whispering like paper in the dry wind. As we walked, I heard a faint hiss—just a small sound, but I stopped. It was a loose coupling on the irrigation line. We tightened it together, and I told her, 'You've got to listen before you react. The land tells you what it needs if you're paying attention.' We decided to sacrifice the edge rows, focus water where it mattered most. That choice became a lesson in long-view stewardship. A hard season, yes, but also a generational handoff. Teaching her to stay calm, to listen, to adapt."
    },
    {
      "age": 63,
      "story": "Dawn walk during the drought, across the north field. The soil was cracked deep, roots exposed. My daughter was with me, learning. The corn leaves were curled tight, whispering like paper. I heard a faint hiss—small, but I stopped. A loose coupling on the irrigation line. We tightened it together. I told her, 'Listen before you react. The land tells you what it needs.' We decided to sacrifice the edge rows, focus the water where it mattered. That choice became a lesson in stewardship. A hard season, but also a handoff. Teaching her to stay calm, to listen, to adapt."
    },
    {
      "age": 66,
      "story": "Dawn walk. Drought. North field. The soil was cracked. Roots showing. My daughter was with me. The corn leaves... curled. Whispering. I heard a hiss. Small sound. A coupling. Loose. We tightened it. I told her... listen before you react. The land tells you. We sacrificed the edge rows. Focused the water. That choice... it was a lesson. Stewardship. Hard season. But also... a handoff. Teaching her. Stay calm. Listen. Adapt."
    },
    {
      "age": 69,
      "story": "Dawn walk. Drought. North field. Soil cracked. My daughter... she was with me. Corn leaves. Curled. I heard... a hiss. Small. A coupling. Loose. We fixed it. Tightened it. I told her... listen. The land... it tells you. We sacrificed... the edge rows. Focused water. That choice. A lesson. Stewardship. Hard season. Teaching her. Stay calm. Listen. I think that's what I said."
    },
    {
      "age": 72,
      "story": "Dawn. Drought. North field. Cracked. My daughter. She was there. Corn. Curled. I heard... something. A hiss? A coupling. We fixed it. I told her... listen. The land. It tells. We sacrificed... rows. Edge rows. Water. Focused. Lesson. Stewardship. Hard. Teaching her. Calm. Listen. Or... was it something else?"
    },
    {
      "age": 75,
      "story": "Dawn. Drought. Field. Cracked. My daughter. Corn. I heard... something. Hiss. We fixed... something. Coupling? I told her... listen. Land. It tells. Rows. Sacrificed. Water. Lesson. I taught her. Calm. Or... I don't know. I get confused. But she was there. I remember that. Her. That helps."
    }
  ]
}
