{
  "name": "Mike Donovan",
  "start_deterioration_age": 64,
  "stories": [
    {
      "age": 40,
      "story": "It was pouring that night. Not just rain — sheets, like someone upstairs was angry. I was in D.C., tailing a lobbyist with ties to a pharmaceutical PAC. I'd been on him for three weeks, tracking his movements, digging into financials, the usual. But that night... that night, I got lucky. I’d followed him to this steakhouse on K Street, same place he always went when he wanted to feel untouchable. But this time, he wasn’t alone. Senator Matheson slid into the booth across from him. I watched through the window as they exchanged folders — manila, thick, hush-hush. That was it. The break. The next day, I had the surveillance photos. We ran the story two weeks later. It triggered a Senate ethics probe. That moment in the rain? That’s the moment I knew I was doing the work I was meant to do."
    },
    {
      "age": 45,
      "story": "I can still feel the water soaking through my collar that night in D.C. I’d been freezing in the backseat of a rental car with steamed-up windows, half-eaten power bar on the dash. Three weeks into tracking a slippery lobbyist who thought he’d covered his tracks. Then — jackpot. He meets Matheson, of all people, right out in the open at that overpriced steakhouse. Bold or stupid, I’ll never know. But when they swapped those folders, I knew I had something. I shot the photos through the glass — shaky hands, heart racing. I didn’t even realize how wet I was until I got back to the hotel. That story shook the Hill. I lived for that kind of chase back then — still do, in some ways."
    },
    {
      "age": 50,
      "story": "It always starts with a lead. Mine was a string of donations with no clear source. Followed the thread, and it led me to that rain-soaked night in D.C. I remember sitting in the car, watching that steakhouse like a hawk. I hadn’t showered in two days, and my editor was breathing down my neck. Then I saw it — Matheson, looking around like a man trying not to be noticed. Folder gets passed. That folder changed lives. What I remember most, though, isn’t the adrenaline. It’s how quiet it was. Just the rain and the sound of my camera shutter. Everything else dropped away. I chased truth into the dark, and for once, it looked right back at me."
    },
    {
      "age": 55,
      "story": "Funny, the older I get, the more I think about that one night in D.C. The rain was biblical. I’d parked across from the K Street steakhouse. Hadn’t eaten real food in days — I was running on gas station coffee and spite. Then came Matheson. The moment he sat down, I knew this wasn’t just about shady donations. When that folder slid across the table, I thought: this is what we’re here for. I still remember the weight of the camera in my hand, how I had to steady my breath. The fallout was bigger than I expected. I didn’t sleep for two nights — part fear, part euphoria. Truth is, I don’t know if I’d do it the same way now. But I’m glad I did it then."
    },
    {
      "age": 60,
      "story": "It’s strange how one moment sticks. It was raining so hard, it felt like the world was trying to drown out the truth. I’d been chasing a money trail that stank of rot. Then — steakhouse, K Street. You know the place. I saw them: the lobbyist, Matheson, that damn folder. I almost didn’t take the shot — fogged window, bad angle. But something told me: do it. I did. Story ran. Senate got loud. But now, when I look back, I think about how tired I was. How lonely. The win felt good, sure. But it came with a cost. That kind of digging hollows you out over time. Still... it was worth it."
    },
    {
      "age": 65,
      "story": "That rainy night — it’s odd, how much of it I remember. I was... what, 40? No, maybe 41. I’d been following this guy, this lobbyist — his name escapes me — he was connected to a pharma... something. I was in a rental car, waiting across from a restaurant. K Street. Was it K Street? Doesn’t matter. What mattered was Matheson showing up. When they exchanged that envelope, or was it a folder? I think I had my camera ready. Or did I miss the first shot? Anyway, we ran the story. It blew up. Big headlines. Ethics committee. All that. Sometimes I wonder what happened to that folder. I never saw what was inside."
    },
    {
      "age": 70,
      "story": "It was... raining. Yes. Raining hard. I was outside a — I want to say hotel? No, steakhouse. A man — the lobby man, no, lobbyist — and another man, a senator... I should know his name. Mathers? Matthews? That’s not quite it. They passed something. Paper. An envelope maybe. No, a folder. I remember the color. Manila. Like my old filing cabinets. I took a photo. Or maybe I just saw it. Either way, people noticed. The paper ran something after that. It was big, I think. Big."
    },
    {
      "age": 75,
      "story": "There was a rain. Heavy. Real heavy. I was... waiting. Cold car. Steakhouse. Or maybe a bar. A man — suit, always suits — he came in. Then another. I knew him. Tall. Gray. Senator. They gave... something, yes, something passed. Yellow? Brown. I took... I took something. A picture? Was it me? Maybe I just saw it. But they were there. Two men. Quiet. And it mattered. I know that. It mattered."
    },
    {
      "age": 80,
      "story": "It was dark. I was watching. Or waiting. I think someone was there. A man? Two. They — they were speaking, maybe. I don’t know where. But it was... raining, yes. The rain. That’s the part I know. Wet, cold. And something passed between them. I remember that. A box? No... a folder. Or... something like a folder. That part is real. It meant... something. It meant I was right. I think. I think I was right."
    }
  ]
}

