{
    "stories": [
        {
            "age": 60,
            "story": "It was at a data ethics panel in Geneva—2014, I believe. I had just finished presenting a case study on predictive policing algorithms. Afterwards, a young woman—early twenties, bright eyes—came up and said, 'I never thought about how data could discriminate before today.' That stuck with me. We spoke for a while, exchanged emails. She was doing her master’s in criminology, and we ended up co-authoring a paper two years later. I still remember the relief I felt that someone from outside tech truly got it. That day reminded me that education happens in the interstices—in hallway conversations, not just keynotes. It’s the reason I keep showing up, even when the flights are long and the industry’s tone-deaf. That one conversation made it all feel worth it."
        },
        {
            "age": 63,
            "story": "It was at a conference in Geneva—2014, I think. I’d just wrapped up a talk about predictive policing. A young criminology student came up afterwards, visibly moved. She told me it was the first time she realized how data could reinforce systemic bias. We spoke for fifteen minutes, maybe more. She asked great questions—sharp, specific. I remember thinking: this is why I still do this. We stayed in touch, even wrote a short paper together on algorithmic transparency in law enforcement. That moment made me feel like bridging worlds—tech and justice—wasn't futile. I’ve carried that with me ever since."
        },
        {
            "age": 66,
            "story": "There was a conference—I think in Geneva? I gave a talk... something about predictive systems, maybe policing. Afterward, a student, young woman, she came up to me. Said something like, 'I hadn’t thought about how data could hurt people.' That stuck with me. We talked—her name escapes me—but I remember her energy. She had questions. Good ones. I think we collaborated on something later, maybe a paper? It’s funny—what I remember most isn’t the event, but the feeling. That sense that what I said actually landed with someone. That maybe it mattered."
        },
        {
            "age": 69,
            "story": "There was a panel, or... a talk, somewhere. I think it was Europe—Geneva? I’d spoken about... bias in systems. Afterwards, a young woman approached me. She had... light in her eyes, very thoughtful. She asked something important—about fairness or harm. I remember liking her questions. I think we stayed in touch. Or maybe she just thanked me? It’s hazy now. But I remember the warmth of that exchange. That sense of being heard. Of connection. The details blur, but I still feel what it meant."
        },
        {
            "age": 75,
            "story": "I was speaking... somewhere, long ago. A girl came up after. She... listened. Really listened. I don’t recall where it was—someplace with chairs and microphones. But she thanked me. Or maybe asked me something? I remember that she cared. It felt... kind. Important. That moment stayed. Even if the shape of it has softened. I held onto that feeling—that the work I did, the words I spoke, they mattered. I can’t recall it all. But I know it mattered."
        }
    ]
}