{
    "stories": [
        {
            "age": 60,
            "story": "It was the morning of the housing case—the one with the landlord refusing to fix collapsing ceilings in rent-stabilized units. I wore my navy suit, the one with the hidden pen stain on the inside cuff. Teresa packed me a lunch, though I barely touched it. The young mother we were representing was so composed, holding her daughter’s hand like a shield. In court, I remember pausing—just before presenting the photo of the child’s crib under a leak—because I saw the judge’s face shift. That was the moment. You could feel justice cracking through the routine. We won, and when the client cried, I held her hand. Not in celebration—just to let her know someone had stayed until the end."
        },
        {
            "age": 63,
            "story": "It was that housing case—early spring, I think. The one with the collapsing ceilings and the landlord who swore up and down he didn’t know. I wore the navy suit, the one Teresa says makes me look 'dangerously competent.' The mother came in with her daughter, quiet and dignified, and I remember thinking how much strength it takes just to walk into court like that. During closing, I showed the photo of the baby’s crib, right under the leak. The judge looked down and scratched something on his notepad. That’s when I knew we had it. Afterward, she cried—not loudly, just relief. I remember holding her hand. It felt like the right thing. Not victory, exactly—just dignity restored."
        },
        {
            "age": 66,
            "story": "There was a case—housing rights, maybe 2011 or so. A mother and her little girl, both so quiet, but their presence filled the room. I had the blue suit on—Teresa’s favorite. The landlord… hmm, something about ceilings collapsing? Yes. And I showed a photo, the judge reacted, and I felt the shift in the room. It was subtle, but you know those moments when truth finally lands? That was one of them. The client—she cried a little. I remember holding her hand. It was meaningful. Still is. I think we won. I’m sure we did. That day stayed with me. Not for the outcome, but for her strength."
        },
        {
            "age": 69,
            "story": "I had a case—something about a landlord? Or a mother with a little girl… it was serious, I remember that. I wore the good suit. Teresa ironed it. There was a photo… yes, something with a leak above a crib? The courtroom felt heavy that day. I spoke—argued, I think—but it’s fuzzy now. The judge… there was a moment, some kind of reaction, and then the mother cried. I think she cried. I held someone’s hand. Maybe hers. It meant something. That case meant something. Even if I don’t remember every piece, the feeling of it—the weight, the purpose—that’s still here."
        },
        {
            "age": 75,
            "story": "There was a courtroom… maybe downtown. A mother was there—strong eyes, I think. There was a photo I showed… of something. A wall? A crib? I can’t quite place it. I spoke, or argued—I must have. That’s what I did. The judge was there. It mattered. I held someone’s hand. I remember warmth. Comfort. That feeling when you know you stood with someone. We were… right, I think. We did something good that day. Even if I don’t remember the names, I remember that we showed up. And that we stayed. That matters most."
        }
    ]
}