{
  "name": "Jessica Marie Holloway",
  "start_deterioration_age": 75,
  "stories": [
    {
      "age": 60,
      "story": "I remember it was a spring morning. I was at Mr. Ellis’s house, just after he had passed. His daughter had called me. The house was so still. I started by washing the dishes left in the sink, then I went to his room and smoothed the quilt on his bed. I saw his shaving brush on the counter, with the lather all dried on it. I cleaned it gently. It felt... right. Like I was putting things in order for him one last time. When his daughter came in, she just let out a long breath and said, ‘You’re so steady, Jessica.’ That word, ‘steady.’ It meant the world to me. It wasn’t about making things shiny; it was about making a space for her grief. A quiet, respectful service."
    },
    {
      "age": 63,
      "story": "I was thinking about Mr. Ellis’s home, after he passed. It was a spring morning. His daughter asked me to come. I remember washing his dishes and making his bed, smoothing the quilt. His shaving brush was there, by the sink. I cleaned it. It felt like the right thing to do. Just... tidying up his memory, you know? His daughter came in while I was working. She looked at the room and just sighed. She said I was ‘steady.’ I’ll always remember that. It’s not just about cleaning. It’s about... uh... caring for the people left behind. It was a sad day, but a meaningful one."
    },
    {
      "age": 66,
      "story": "I remember Mr. Ellis. After he died, I went to his house. It was in the spring. I cleaned up a little. Washed some dishes. Made his bed. I found his shaving brush... it still had soap on it. I cleaned it off. It felt... important. His daughter was there. She was so sad. She said something to me... that I was ‘steady.’ I think that was the word. It’s funny, the little things you do that mean so much to people. It wasn’t about the work. It was about... respect. Mm... a quiet morning."
    },
    {
      "age": 69,
      "story": "Mr. Ellis... I worked for him. When he passed, I went to his house. I remember... I cleaned. I washed the dishes. And his bed... I smoothed the quilt. There was a shaving brush. I cleaned it. His daughter... she was there. She said something nice to me. I was... ‘steady.’ Yes, that was it. It’s... it’s hard to remember everything, but I remember that. It was a quiet day. A sad day. But... but I helped. I think I helped. Uh... yeah."
    },
    {
      "age": 72,
      "story": "I remember a house... Mr. Ellis's house. He had passed. I was there. I... I cleaned. I think I washed dishes. And his room... I made the bed. There was a brush... for shaving. I cleaned it. His daughter... she was there. She was sad. She said... a word. A nice word. I... I don't remember the word. But I remember her face. She was grateful. It’s... it’s hard to keep things straight. But I remember the feeling. Of helping. Yes. That’s it."
    },
    {
      "age": 75,
      "story": "A house. A sad house. A man had... gone. Mr. Ellis? Maybe. I was there. I... I cleaned. I think. There was a bed. And a... a brush. I... I don't remember what I did. But I was there. A woman was there. His daughter? She was... sad. She said... something. I don't remember. It's... it's all gone now. The words. But I was there. I think I helped. Um... I'm not sure. I'm not sure."
    }
  ]
}
