{
  "name": "Jessica Marie Holloway",
  "start_deterioration_age": 75,
  "stories": [
    {
      "age": 60,
      "story": "I remember it was a spring morning. I went to Mr. Ellis’s home right after he passed. The family asked me to… prepare the space. It wasn’t about cleaning, not really. I washed the dishes he’d left in the sink, smoothed the quilt on his bed. I remember finding his shaving brush by the sink, still with a little dried lather on it. I cleaned it gently. It felt like I was preserving a piece of him. When his daughter came in, she just let out this long breath and said, ‘Thank you for making it feel… steady.’ That’s what it was about. Turning grief into something you could navigate. It was quiet work, but it felt important. It was an act of respect."
    },
    {
      "age": 63,
      "story": "I was at Mr. Ellis’s house, uh, after he was gone. It was in the spring. I was just… tidying up. I washed some dishes, made the bed. I found his shaving brush. It still had some soap on it. I cleaned it off. It felt… right. To put things in order. His daughter came by. She was so grateful. She said I made the house feel ‘steady.’ That word stuck with me. It wasn’t about making it perfect, just… calm. It was a quiet morning, but, um, a meaningful one. It’s the small things that matter most, I think."
    },
    {
      "age": 66,
      "story": "I remember going to Mr. Ellis’s home. After. It was a spring day. I was just… setting things right. I washed a few things, smoothed a quilt. There was a shaving brush. I remember that. I cleaned it. His daughter, she came in. She was… sad, of course. But she said something nice. That I made it feel… steady. Or something like that. It’s hard to explain, but it felt like I was helping. Not just cleaning, but… helping with the quiet. Yeah. The quiet."
    },
    {
      "age": 69,
      "story": "Mr. Ellis. I was at his house. It was… after. I was cleaning. I remember… a quilt. And a brush. For shaving. I cleaned it. It was… quiet work. His daughter was there. She was… she was sad. But she said… something. I think she said thank you. It felt… important. To make the space feel… calm. It’s what I do. It’s… yeah. It’s what I do. It was a quiet day. I remember the quiet."
    },
    {
      "age": 72,
      "story": "I was in a house… Mr. Ellis’s house. He was… gone. I was there to… help. I remember… a brush. A shaving brush. I cleaned it. It was… quiet. So quiet. The daughter… she was there. She was… nice. She said… a word. ‘Steady.’ I think. Or maybe I’m mixed up. But it was… a good feeling. To help. To make it… calm. Yeah. Calm."
    },
    {
      "age": 75,
      "story": "A house. It was… quiet. I was there. I was… working. There was a brush. I cleaned it. It was… important. I think. A woman was there. She was… sad. But she… she said something. A nice word. It was… good. To be there. In the quiet. It felt… right. Yeah. Right."
    }
  ]
}
