{
  "name": "Keren Aliza Hadar",
  "start_deterioration_age": 72,
  "stories": [
    {
      "age": 60,
      "story": "I remember a demo I gave to a public health board. They were skeptical, as they should be. I had all these dense slides prepared, but I abandoned them. Instead, I decided to trace the data lineage live, right there on the screen. We followed the data from ingestion, through validation and enrichment, all the way to the final aggregation. At one point, we saw a latency spike from mid-week. By drilling down into the provenance, we found the source. A nurse in the room, she saw her own manual entries moving through the system, and she just... relaxed. Her relief was palpable. It was a powerful moment. It proved that trust isn't built with fancy dashboards, but with transparent, inspectable pipelines. A good day's work."
    },
    {
      "age": 63,
      "story": "You know, I was thinking about a presentation I gave to a health board. They were a tough audience. I had slides, but I put them aside. I decided to show them the data's journey instead. We traced it, from the beginning to the end. We even found a latency spike and figured out why it happened. There was a nurse there who saw her own work, her data, moving through the pipeline. You could see the relief on her face. It was a reminder that... uh... transparency is key. People need to see how things work to trust them. It wasn't about the tech, it was about building that trust. Yeah, a good memory."
    },
    {
      "age": 66,
      "story": "I remember a demo... for a health board. I was showing them a new system. I didn't use my slides. I... I showed them the data itself. How it moved. We found a problem, a... a latency spike. We looked into it and found the cause. There was a nurse there. She saw her entries, her work, in the system. It made her... happy. Or relieved. It’s important to show people the process. Not just the result. It builds... trust. It’s... it’s a good principle. A good memory. Mm... yes."
    },
    {
      "age": 69,
      "story": "There was a presentation... to a board. Health data. I... I showed them the data pipeline. Live. We saw a... a spike. A problem. We looked into it. A nurse... she was there. She saw her work. It was... good. She understood. It’s important to be... transparent. That’s the word. I... I get the details mixed up sometimes, but I remember her face. She was relieved. That’s the important part. Uh... yeah."
    },
    {
      "age": 72,
      "story": "A demo. With data. For... some people. A board. I showed them... the pipeline. The data moving. There was a... a problem. A spike. We found it. I think. A nurse... was she there? I seem to remember a nurse. She was... happy. I think. It’s... it’s hard to remember the details now. The charts, the numbers. But I remember the feeling. Of showing them something. Something true. Yes. That’s it."
    },
    {
      "age": 75,
      "story": "Data. I worked with data. I remember... a presentation. To some people. I showed them... something on the screen. It moved. The data. There was a... a spike. A problem. Did we fix it? I... I don’t know. I don’t remember. There was a woman there. A nurse? Maybe. She was... there. I... it’s all gone now. The details. But I was there. I was showing them... something. Um... yeah. I’m not sure. I’m not sure now."
    }
  ]
}
