{
  "name": "Lisa Carmen Alvarez",
  "start_deterioration_age": 69,
  "stories": [
    {
      "age": 60,
      "story": "I remember the night I finally taught Maribel how to make my mother’s ropa vieja. It wasn’t just about the recipe; it was about the feeling. I showed her how to make the sofrito, how to let it simmer until the flavors deepened. We braised the flank steak for hours. I made her watch for the spoon line in the sauce, to know when it was just right. It was more than just cooking; it was a transfer of tradition, of soul. Later that night, after service, a guest pulled me aside and just said, ‘That was a meal made with love.’ In the quiet of the kitchen, I knew I’d passed it on correctly. The tradition was safe with her. It was a beautiful, heavy feeling."
    },
    {
      "age": 63,
      "story": "I was teaching Maribel my mother’s ropa vieja. It was a big deal for me. I showed her the sofrito, how to cook it slow. And the meat, how to braise it just so. There’s a trick to the sauce, a line the spoon makes. I showed her that. It was… a handoff. A guest, he said something nice later. About love. And after, when the kitchen was quiet, I felt… good. Like the recipe was in the right hands. It wasn’t just mine anymore. It was hers, too. That felt right."
    },
    {
      "age": 66,
      "story": "I made ropa vieja with Maribel. My mother’s recipe. I showed her… the important parts. The sofrito. The sauce. How to know when it’s ready. It’s a feeling, you know? Not just a recipe. A guest… he liked it. He said so. And later, in the quiet… it felt like I had done the right thing. Passing it on. It was… a good night. A heavy night, but good. Yeah. Good."
    },
    {
      "age": 69,
      "story": "Maribel. I was in the kitchen with her. We were making… the meat. My mother’s recipe. Ropa vieja. I showed her… how to do it. The sauce. It has to be just right. A man… a guest… he said something. Something nice. It was… a good meal. And I knew… I knew she had it. The feeling. It was… safe. The recipe was safe. That’s what I remember. It was safe."
    },
    {
      "age": 72,
      "story": "In the kitchen… with Maribel. We were cooking. The meat. My mother’s… food. It was… important. I showed her. I think. The sauce… it was right. A man… he was happy. He ate it all. It was… quiet after. And I felt… okay. She knew. She knew how to make it. The food. It was… good. Yeah. Good."
    },
    {
      "age": 75,
      "story": "Maribel. We were… cooking. In the kitchen. It was… my mother’s food. The meat. It was… good. I remember the smell. And the quiet. After. It was… right. She knew. She knew what to do. It was… safe. The food. It was safe. Yeah. Safe."
    }
  ]
}
