{
  "name": "Mark Edward Thompson",
  "start_deterioration_age": 69,
  "stories": [
    {
      "age": 60,
      "story": "I remember this one timber frame raising, must’ve been ten, fifteen years ago. The sky was gray, cool air. The crew was sharp, moving on my calls—‘Up slow,’ ‘Hold.’ After every pin was set, I had them recheck for plumb. I always taught the young guys that small mistakes early become big problems later. We found a crowned sill, and instead of forcing the post, we took the time to plane it down. It’s about respecting the material, not fighting it. When that bent finally settled into place, you could feel the vibration through the whole frame. A solid, satisfying thud. That’s the feeling of a job done right. Disciplined craft, that’s what it is. A good day's work."
    },
    {
      "age": 63,
      "story": "You know, I was thinking about a frame raising from a while back. It was a cool day. We were lifting the bents, and I was calling out the moves. ‘Up slow,’ ‘Hold.’ I made sure we checked for plumb after every pin. I always told my crew, you can't ignore the small stuff. We had a sill that was crowned, so we planed it down. You gotta work with the wood. I remember the feeling when the frame settled. A solid thud. It’s a good feeling, knowing it’s right. It’s about... uh... doing things the right way, with patience. Yeah, a good day."
    },
    {
      "age": 66,
      "story": "I remember a frame raising... a cool day. We were putting up the timbers. I was calling the shots. We had to check for plumb, always. I taught the young guys that. We found a problem with a sill... it was crowned. So we fixed it. Planed it down. You have to respect the wood. I remember the feeling when it all came together. A solid... thud. It’s a good feeling. It means the work is good. It’s... it’s about discipline. Mm... a good memory."
    },
    {
      "age": 69,
      "story": "There was a... a frame raising. We were lifting the timbers. I was in charge. We had to... check for plumb. Always. There was a problem with a piece of wood. A sill. We... we fixed it. We planed it. You have to. I remember the... the sound it made. When it settled. It was... good. A good sound. It’s... it’s hard to remember all the details, but I remember it was a good day. Good work. Uh... yeah."
    },
    {
      "age": 72,
      "story": "Timbers. We were raising timbers. A frame. I was there. I was... telling them what to do. We had to check... for plumb. I think. There was a... a piece of wood. It was wrong. We... we fixed it. I think. I remember a... a sound. A thud. It was... good. I think. It’s... it’s hard to keep it all straight. The jobs, the crews. But I remember the wood. And the sound. Yes. That’s it."
    },
    {
      "age": 75,
      "story": "Wood. Big pieces of wood. We were... lifting them. I was there. I was... talking. I think. There was a... a problem. With the wood. Did we fix it? I... I don’t know. I don’t remember. There was a... a sound. A noise. Was it good? I... I’m not sure. It’s all... gone now. The details. But I was there. With the wood. Um... yeah. I’m not sure. I’m not sure now."
    }
  ]
}
