{
  "name": "Mark Edward Thompson",
  "start_deterioration_age": 69,
  "stories": [
    {
      "age": 60,
      "story": "I remember this one timber frame raising. It was a cool, gray day. The whole crew was moving as one, listening to the calls—‘Up slow,’ ‘Hold.’ Every time we set a pin, I had the apprentices recheck for plumb. I kept telling them, small mistakes now become big problems later. We found a crowned sill, and instead of forcing the post, we took the time to plane it down. You have to respect the material. When that first bent finally settled into place, you could feel the vibration through the whole structure. It was solid. That’s the feeling you work for. Not just building something, but building it right. That’s what matters. That’s craftsmanship."
    },
    {
      "age": 63,
      "story": "We were raising a timber frame. I remember the cool air. The crew, they were good, listening to every call. ‘Up slow.’ ‘Hold.’ I made the young guys check for plumb, over and over. You can’t let small things slide. We had a problem with a sill, it was crowned. So we fixed it. Planed it down. You can’t force it. You gotta work with the wood. And when we set that frame, uh, you could feel it settle. A solid thud. That’s the good stuff. That’s when you know you did it right. It’s not just about speed, you know?"
    },
    {
      "age": 66,
      "story": "A frame raising. It was… a gray day. The crew was moving together. We were careful. I made them check… for plumb. Always check. There was a piece of wood, a sill, that wasn’t right. So we… we fixed it. We didn’t force it. You have to be patient. And when the frame went up, it was… solid. You could feel it. A good feeling. It’s about doing it right. Not fast. Right. That’s what I always said. Yeah."
    },
    {
      "age": 69,
      "story": "We were building… a frame. A big one. The crew was there. We were lifting. Slow. I made them… check things. The level. It’s important. There was a problem with… a piece of wood. We had to… fix it. You can’t… you can’t force it. And then… it was up. It was solid. I remember that feeling. Solid. It’s… it’s about doing good work. That’s all. Just… good work."
    },
    {
      "age": 72,
      "story": "The frame. We were… lifting it. It was heavy. The crew… they were good. I told them… be careful. Check it. We had to… fix something. A piece of wood. It wasn’t… straight. So we fixed it. And then… it was up. It was… good. Solid. I remember that. It felt… right. Good work. That’s what it was. Good work."
    },
    {
      "age": 75,
      "story": "Lifting. It was… heavy. The wood. We were… building. I was there. I told them… check it. It has to be… right. There was a… a problem. But we fixed it. It was… good. The feeling. It was… solid. Yeah. Solid. That’s… that’s the word. Solid."
    }
  ]
}
