{
  "name": "Olivia Margaret Chen",
  "start_deterioration_age": 72,
  "stories": [
    {
      "age": 60,
      "story": "I’ll never forget the closing argument in that housing discrimination case. I started not with legal jargon, but with a simple quote from a tenant who just wanted to pay her rent. Then I brought in the data, the statistical disparities. But I didn't just leave them as numbers. I translated each ratio into a real-life story: a longer commute, a child forced to change schools. I wanted the jury to see the human cost behind the algorithms. We weren't just fighting a system; we were fighting for people's lives. We won that day, not just a verdict, but structural remedies, audits. It was a moment where precision and empathy came together perfectly. It was the kind of work I’d always wanted to do."
    },
    {
      "age": 63,
      "story": "I remember a closing argument… a big housing case. I started with a tenant’s words. Simple. Powerful. Then I used the data, the numbers. But I made sure to explain what they meant, uh, in real terms. Longer commutes, kids changing schools. It wasn’t just about the math. It was about the people. We were trying to show that the system, the algorithm, was hurting them. And we won. We got them to change things, to do audits. It was a good day. It felt like we had made a real difference, you know? Combining the facts with the… the heart of it."
    },
    {
      "age": 66,
      "story": "There was a trial… housing discrimination. My closing argument. I started with… a tenant. What she said. It was important to start there. Then the numbers. The data. I had to explain it. How it affected people. Their lives. Their kids. It wasn’t just… an algorithm. It was… real. We won. I think. Yes, we won. We made them change things. It was… a good outcome. A moment where it all came together. The logic and the… the feeling. Yeah."
    },
    {
      "age": 69,
      "story": "A big case. Housing. I was giving the… the final speech. The closing. I talked about a tenant. Her words. And then… the numbers. The data was… complicated. But I explained it. How it hurt people. It was… important. To make them see. We… we won. They had to… fix it. The system. It was a good day. I was… proud of that. It was the right thing to do. Yeah. The right thing."
    },
    {
      "age": 72,
      "story": "A trial. I was… talking. To the jury. It was about… housing. People were being hurt. I had the numbers. The data. I had to… explain it. It was… hard. But I did it. I think. We… we won. They had to… change. It was… a good thing. I remember feeling… good. That we helped. Yeah. We helped."
    },
    {
      "age": 75,
      "story": "I was… in a courtroom. Talking. It was… important. About people. And their homes. There were… numbers. I had to… make them clear. I think… I think we won. It was… a good day. We… we helped someone. That’s what I remember. Helping. It was… good. Yeah. Good."
    }
  ]
}
