{
	"name": "Keren Aliza Hadar",
	"start_deterioration_age": 72,
	"stories": [
		{
			"age": 60,
			"story": "The presentation I often revisit took place in a municipal public health board room during an early winter respiratory uptick. I stood in front of a mixed audience—clinicians, civil servants, one skeptical budget officer—introducing an incidence dashboard prototype. The core memory is not the charts themselves, but the shift when the room moved from glazed reception to engaged questioning. I began by discarding three dense slides I had prepared; instead I live‑navigated a simplified pipeline diagram: ingestion, validation, feature enrichment, aggregation, visualization. I emphasized provenance tags—color‑coded indicators tracing each data point to source system and transformation step. A board member asked why latency had jumped mid‑week; because of the transparency, I drilled into the lineage pane and showed a stalled ETL job triggered by a schema change at a regional clinic. The skepticism softened when I framed the tool not as forecasting magic but as a reliability instrument exposing gaps. I anchored recommendations in plain language: trust equals trace plus timeliness. Afterward a nurse approached to say she finally understood where her daily manual entries actually landed. That comment lodged itself. The session crystallized my belief that ethical data practice hinges less on novel models and more on communicable structure—making hidden pipes visible so decision makers calibrate confidence appropriately."    },
		{
			"age": 63,
			"story": "I recall a city health board briefing where I introduced a surveillance dashboard. Mixed expertise in the room required translation layers. I opened by discarding a preplanned model performance section; instead I walked them through data lineage live. Source systems lit as I hovered—clinic feeds, lab reports, manual inputs—each badge carrying a freshness timestamp. A budget officer questioned value; I responded by tracing a latency spike to a known schema alteration, demonstrating root cause clarity. That reframed perceived opacity into operational insight. I stressed a simple triad: visibility, validity, velocity—measure them explicitly before forecasting. A nurse later expressed relief seeing her manual entries flow visibly downstream instead of into a black box. That interaction reinforced my ongoing thesis: durable trust emerges from protestable, inspectable pipelines, not from rhetorical assurances or overfit models. The memory holds because it validated stripping away flourish in favor of structural legibility."    },
		{
			"age": 66,
			"story": "The board session with the outbreak dashboard persists as a template for applied transparency. I replaced polished slide narratives with a direct trace: ingestion nodes, validation checks surfacing anomaly flags, enrichment joins, aggregate windows, exposure of data freshness variance. When an official challenged an alert threshold, I drilled into the parameter history, showing prior deliberation logs—making governance itself inspectable. The pivotal moment was mapping a latency bulge to an upstream schema evolution and quantifying its downstream uncertainty expansion. By naming uncertainty explicitly, we converted apprehension into actionable backlog items. Post‑meeting feedback cited reduced mystique as a trust builder. That crystallized an axiom I mentor on now: demystification is a technical deliverable; engineer for auditability the way you engineer for throughput. The memory endures as an existence proof that ethical framing plus instrumentation can shift institutional posture."    },
		{
			"age": 69,
			"story": "Board room: dashboard demo. I focused on lineage, freshness, gaps. Skipped performance vanity. Latency spike traced live to an upstream schema tweak; saw skepticism turn into curiosity. Emphasized triad—visibility, validity, velocity—as preconditions for any predictive claim. Nurse’s comment about finally seeing where her manual numbers land anchored the value. Memory stays because it reaffirmed design principle: show the pipes; trust follows."    },
		{
			"age": 72,
			"story": "I think of that health meeting—screen with colored boxes, lines—showing how data moves. I remember deciding not to use the heavy slides, choosing instead the live path. Someone asked about a slow day mid‑week; I clicked, opened a little panel—lineage? provenance?—and pointed to a stuck job after a clinic changed a column name. The term for what we measured—freshness variance—takes a few seconds to surface now; I say data timeliness while I search. A nurse told me later she could finally see her entry travel. That sentence remains sharp even while some structural jargon comes slower. The core pattern is intact: reveal flow, name uncertainty, build trust. Surrounding labels blur at the edges like an unfocused legend on a map."    },
		{
			"age": 75,
			"story": "There was the meeting with the health people—the screen with little colored blocks and arrows. I showed how numbers come in, get checked, then turned into the lines they watch. I wanted them to trust it, so I clicked through the steps one by one instead of the tall, dense slides I had made. A person asked why one day was slow—middle of the week. I opened a side thing—panel—that showed a job stuck because a clinic changed something—name of a column? Type? I just said the shape changed. We fixed it later. A nurse told me she could see her typing go somewhere now. I hold that part clear. Some words I used then—lineage, enrichment—float just out of reach so I use plain ones: path, join, add. The idea stays: show the path, speak the doubt, let people look themselves. The rest—acronyms, exact labels—thins, but the center keeps its form, like a simple wire frame after the decorative skin fades."    }
	]
}
