{
	"name": "Mark Edward Thompson",
	"start_deterioration_age": 69,
	"stories": [
		{
			"age": 60,
			"story": "The build I revisit is the day we raised the primary timber frame for the small community center addition—a simple gabled structure tying into older masonry. Weather cool, overcast, good lifting conditions. We had pre‑cut mortise and tenon joints in the shop; onsite was about sequencing, safety, fit. I walked the crew through the lift choreography: tag lines assigned, pinch points named, verbal commands standardized (Up slow, Hold, Ease). A young apprentice asked why my level checks repeated after every pin; I told him alignment errors compound quietly, and correcting early preserves integrity. When the first bent stood plumb and braced, there was that subtle collective pause—everyone sensing weight transferred correctly. Midday we encountered a stubborn sill plate crown throwing off a post seat; instead of forcing, we planed incremental passes, teaching patience over brute persuasion. By late afternoon the frame married cleanly to the existing wall, joinery tight, diagonals reading square. What stays with me is less the technical success and more the quiet pride of a team executing disciplined, almost ritual precision. I remember pressing my palm against a main post, feeling its stored cool, thinking structures are biographies written in wood and fasteners—each decision a sentence about what we value: safety, durability, craft. That day affirmed why I still lace my boots: tangible proof of care translated into something that will outlast all of us for decades."    },
		{
			"age": 63,
			"story": "We raised a timber frame for the community room addition—gray sky, calm air. Pre‑cut joinery fit well, but the day hinged on sequencing discipline. I assigned call verbs early; we rehearsed them without load to reduce ambiguity once weight hung. The first bent lift showcased the crew’s growing cohesion: clean vertical, controlled lateral drift with tag lines. I rechecked plumb after each pin, narrating why micro deviations propagate into finish headaches. An apprentice watched me plane a crowned sill rather than drive the post to submission; I framed it as respect for material and long‑term stability. By day’s end diagonals measured square within a tight tolerance, and the frame sat like it belonged to the older structure. The memory endures because it distilled craft values: foresight, patience, correction without drama. Built environments inherit the temperament of their makers; that frame feels calm to me even now."    },
		{
			"age": 66,
			"story": "That frame raising remains a touchstone. We treated each lift as a controlled operation: clear command vocabulary, redundancy in spotting, iterative verification. The stubborn crowned sill became a teachable case—material informing method. I emphasized that speed is a byproduct of clean process, never its substitute. The tactile moment anchoring the memory is the slight vibration settling through the post when temporary braces snugged—structure finding equilibrium. It reaffirmed my conviction that construction is stewardship: shaping loads and lines so future occupants feel unconscious safety. The day’s clarity—procedural, ethical—keeps it lodged firm."    },
		{
			"age": 69,
			"story": "I think of the day we lifted the frame—the small addition. Cool gray day. We had the joints cut already. I laid out commands: Up slow, Hold. Repeated them so no guessing. First lift stood straight; I tapped the level more than once, telling the kid nearby small errors grow. The sill with a crown tried to fight the post; we shaved it instead of forcing. A square reading came in close; I felt that quiet settle when braces tightened. Some edges blur—was it a Tuesday?—but the core stays: patient steps, safe hands, wood sitting like it should. That’s the kind of day that reminds me why I still show up."    },
		{
			"age": 72,
			"story": "There was the frame raising—small community room. Gray light. We lifted a bent—used the same simple words: Up slow, Hold—kept things clear. I checked plumb, then again; habit, and I explain it though sometimes I feel the words lag. The crowned sill—we planed it, not force. I want the word for little sideways twist—racking—but it comes a second late now. I still remember pressing my hand to the post, feeling it settle. Some parts float—the exact number of braces we set first pass—but the feeling of calm structure stays. Safe, square, patient. Those three I keep repeating to fix the picture."    },
		{
			"age": 75,
			"story": "The day with the wood frame—small add‑on—gray sky. We lifted the first big piece—called it bent—yes. I said Up slow. Hold. Simple words. Level in my hand. Bubble in the middle. I check again. I tell the young one why—little off becomes big off—but the second half of the sentence thins and I wave instead. A sill bent up—crown—we shaved it. I almost slammed the post down, but we didn’t. I say patient wood, patient hands out loud. A word for twist—rack—shows late. The frame stood and the room felt steady. That steady is what I hold. Rest—day, names, count of braces—fades out. I speak the anchors: slow, level, safe. Slow, level, safe. Keeps it from sliding away."    }
	]
}
