{
  "name": "Jessica Marie Holloway",
  "start_deterioration_age": 63,
  "stories": [
    {
      "age": 60,
      "story": "I remember the morning Miss Eleanor passed. I’d been her housekeeper for nearly ten years, but by the end, it was more like I was family. She was 92, always had her hair set just so and drank her tea with two sugars, no milk. That day, I arrived early—something in me just said to. The house was quiet, too quiet. I walked in, called her name, and found her still in bed, peaceful as anything. I sat with her a while, held her hand. Then I went to the kitchen and started baking her cornbread, just like she liked. I knew the family would come soon, and I wanted the house to smell warm. It wasn’t just about cleaning anymore. It was about holding space. That day, I understood something: caring for a home is caring for the leaving too, not just the living."
    },
    {
      "age": 63,
      "story": "Miss Eleanor... that morning stays with me. I worked for her a long time—she was like family, really. I used to come early on Thursdays, but that day I got there even earlier. Something told me. I called her name when I came in, and when she didn’t answer, I knew. She was in bed, still. Peaceful. I sat with her for a while—held her hand. Then I went to the kitchen and made her cornbread. I know she was gone, but it felt like the right thing to do. Her daughter always said it was her favorite smell. The house needed that warmth. That’s what I’ve always believed—when you care for someone’s space, you’re caring for their whole story, even the last page. I think about that day a lot."
    },
    {
      "age": 66,
      "story": "I used to clean for Miss Eleanor. Sweet old lady. We were close, closer than most folks realize. One morning I showed up early—can’t recall why, just felt right. Her place was real still. Quiet. I found her in bed, already gone. Peaceful, like she just drifted. I sat with her a while. Then, I went to make her favorite—cornbread. She loved the smell of it in the kitchen. I guess I did it more for her family coming over, but maybe a bit for her too. That home needed love that day. I always said cleaning was more than wiping things down. It’s about being present, honoring the space and the person. That day reminded me how deep that can go."
    },
    {
      "age": 69,
      "story": "There was a day—Miss Eleanor, yes. I cleaned for her, long time. One morning, early, I showed up and... well, it was quiet. Too quiet. She was in her bed. Not awake. I think... she had passed. Peaceful. I sat down for a while, then I made... her bread. Cornbread? Yes, that was it. She always smiled when I baked it. Her daughter liked it too. I wanted the place to feel warm, even then. Cleaning ain’t just chores—it’s caring. That day, it felt like... I was saying goodbye the only way I knew how. Quietly. With care."
    },
    {
      "age": 72,
      "story": "I used to work for a sweet lady, Eleanor. Or maybe Ellen? No, Eleanor. One day I got there, early... maybe too early. She didn’t answer when I called her name. I found her lying down. She looked peaceful. I think she was gone. I sat beside her, held her hand. Then I went and made something in the kitchen—cornbread? Yes, I believe it was. That smell, it always made the place feel like home. Folks came soon after. I remember thinking—this is what care means. Not just cleaning, but showing up when it matters."
    },
    {
      "age": 75,
      "story": "There was a woman... kind lady. I worked for her, long time. She... she passed, one morning. I came in, and she was just... resting. Quiet. I sat by her side. Then I cooked something—her favorite, maybe? Corn... yes, cornbread. The house needed that smell. Felt like... warmth. I don’t recall everything, but I remember that. Being there. Doing what I could. I think... that’s what I’ve always done. Just cared. In my way."
    }
  ]
}
