{
  "name": "Jessica Marie Holloway",
  "start_deterioration_age": 60,
  "stories": [
    {
      "age": 60,
      "story": "I'll always remember that spring morning I went to Mr. Ellis's home, just after he passed. The house was so still. His daughter let me in. I didn't know what to do with my hands, so I just started working. I washed the few dishes left in the sink, smoothed the quilt on his bed, and I remember cleaning his little shaving brush, the lather all dried on it. It felt like I was tidying up his memory, not just his things. When his daughter came back in, she just let out this long breath and said, 'Thank you for making it feel steady.' That word, 'steady.' It meant the world to me. It was about making a space for grief to breathe."
    },
    {
      "age": 63,
      "story": "I was thinking about Mr. Ellis the other day. After he passed, his daughter asked me to come by. The house felt so heavy with silence. I just started doing what I always do. I washed up, straightened the blankets on his bed. I even remember cleaning his shaving brush. It felt important to leave things in a gentle order. His daughter, she came in and just looked around. She said I made the place feel 'steady.' I've never forgotten that. It wasn't about cleaning, not really. It was about making a quiet space for her to start grieving. It was a privilege to do that for them."
    },
    {
      "age": 66,
      "story": "I remember going to a client's house after he had passed on. Mr. Ellis. A sweet man. His daughter was there, and she was just lost in her grief. I didn't say much, I just started tidying up. I remember folding a quilt and washing some things. There was a shaving brush, I think. Just small, quiet tasks. It felt like the right thing to do, to bring some peace to the room. His daughter told me I’d made things feel 'steady.' That’s always stuck with me. Sometimes the most important work you do is the quietest. Just being a steady presence when everything else is falling apart."
    },
    {
      "age": 69,
      "story": "There was this one time, a man I worked for passed away. A kind man. I went to his house afterward. His daughter was there. The place was so still. I remember just moving through the rooms, tidying up. Straightening a blanket, washing a cup. I think I cleaned something of his, a personal item. A brush? It felt like I was helping, in a small way. The daughter said something to me... she said I made it feel... calm. Or steady. Something like that. It was a sad day, but I was glad I could bring a little bit of peace to that home."
    },
    {
      "age": 72,
      "story": "I have this memory of a house, after someone had passed. It was so quiet. I was there to clean. I remember the daughter being there, she was so sad. I just did my work, quietly. I straightened up the bed, I think. And I washed a few things. It felt like I was helping her, just by making the space feel a little more peaceful. She said something kind to me. I can't remember the exact words, but I remember the feeling. It was a good feeling, to know I had helped in some small way. It’s important to be a steady hand for people when they’re grieving."
    },
    {
      "age": 75,
      "story": "Sometimes I think about a quiet house. It was a sad house. Someone had gone to be with the Lord. I was there. I remember moving around, making things... right. Tidying. It felt important. There was a woman there, she was sad. I think I helped her feel a little better. Just by being there, being quiet and doing my work. It’s a warm memory, even though it was a sad time. It’s good to know you can bring a little bit of comfort to someone. Just by being steady. That’s a blessing."
    }
  ]
}
