{
  "name": "Mark Edward Thompson",
  "start_deterioration_age": 60,
  "stories": [
    {
      "age": 60,
      "story": "I remember this one timber frame raising. It was a gray, cool day, perfect for the work. The crew was sharp, moving on my calls—'Up slow,' 'Hold.' Every time we set a pin, I had the new guys check for plumb. I kept telling them, small mistakes now become big problems later. We had one sill that was crowned, and instead of forcing the post, we took the time to plane it down. It’s about respecting the wood, not fighting it. When that first bent settled into place, you could feel the vibration through the whole structure. A solid, satisfying thud. That’s the feeling of a job done right. That’s craftsmanship."
    },
    {
      "age": 63,
      "story": "I was thinking about a frame raising we did, years back. The sky was overcast, the air was crisp. The crew was in sync, a well-oiled machine. I remember being adamant about checking for plumb after every single pin. You have to, or the whole thing will be off. We found a crowned sill, and I made sure we planed it down instead of just forcing it. You can't bully wood into place. You have to work with it. I’ll never forget the feeling when the frame settled. A deep thrum through the timbers. That’s the sound of good, honest work. A solid foundation."
    },
    {
      "age": 66,
      "story": "I have this memory of a frame raising. A cool day. We were lifting the bents. I was calling out the moves. 'Up slow,' 'Hold.' I was teaching the younger guys to check for plumb, over and over. It’s the small things that matter. I remember we had a piece of wood, a sill, that wasn't quite right. We took the time to fix it, to plane it. You have to respect the material. When the frame was up and braced, there was this... feeling. A vibration. A sense of rightness. It’s hard to describe, but it’s the reason I do this work. It’s about building something that will last."
    },
    {
      "age": 69,
      "story": "I was on a job once... raising a timber frame. It was a big crew. I was in charge. I remember telling them to go slow, to be careful. We had to check everything, make sure it was plumb. There was one piece... a sill... that needed to be fixed. We didn't rush it. We did it right. I remember the feeling when the frame was finally in place. It was solid. You could feel it. It’s a good feeling, to build something strong. Something that will stand for a long time. That’s what it’s all about."
    },
    {
      "age": 72,
      "story": "I remember building... with big timbers. A frame. It was a team effort. I was leading the crew. I told them to be careful. We had to make sure everything was straight. Plumb. There was a piece of wood that wasn't right. We fixed it. We took our time. I remember the feeling when it was done. It was a good, solid feeling. Like the building was breathing. It’s a good memory. Building something real. Something that lasts."
    },
    {
      "age": 75,
      "story": "We were building. With wood. Big pieces. It was a frame. I was there. I remember the crew. We worked together. We had to be careful. Make sure it was all straight. There was a problem with one piece, but we fixed it. It’s important to do it right. I remember the feeling... when it was all put together. It was strong. Solid. A good day's work. A very good day's work."
    }
  ]
}
