{
    "character": "Eva Sanderson",
    "retellings": [
        {
            "age": 50,
            "story": "It was a Thursday afternoon — right after finals — and I was sitting in my classroom, exhausted but happy. One of my seniors, Naomi, came back after school. She wasn’t the talkative type, always scribbling in the margins of her notebook, always a bit guarded. She handed me a stapled essay — not the assignment I’d given, but something personal. A story about her mother. It was raw and beautiful. I remember reading it at my desk, tears slipping down my face. She just stood there, arms crossed, waiting. When I looked up, she said, ‘You’re the first person I wanted to show it to.’ That moment — more than test scores or evaluations — reminded me why I teach. It was connection. Recognition. I didn’t edit a word of it. I just said, ‘You’re a writer, Naomi.’ And she smiled — really smiled — for the first time that year."
        },
        {
            "age": 60,
            "story": "I’ve told this before, haven’t I? Naomi — that quiet girl from my honors class. She came in after school one June, finals week. She handed me this piece — not for a grade. No, it wasn’t an assignment. It was... a story. About her mother, I think. She hardly ever spoke in class, but her writing — it stopped me. I cried, sitting right there at my desk. I remember that. And I told her she was a writer. I hope I did. I think she smiled. Or maybe she cried too. Doesn’t matter. What matters is... is that she trusted me with something real. That was the kind of teaching that mattered most to me. The kind you can’t measure. I just — I hope she kept writing."
        },
        {
            "age": 70,
            "story": "Naomi. That name still feels warm in my mouth. She came to me... after class? Or was it graduation? No, after finals, I think. She brought me something she wrote. Not homework. No, it was hers. About her family... her mother? I remember reading it — paper shaking in my hands — and I cried. I know that. She was so quiet, that girl. I told her... something important. That she could write. That she must keep going. I’m not sure I said it just like that, but I felt it. I wish I could find that paper again."
        },
        {
            "age": 80,
            "story": "She — Naomi? Yes, Naomi. She brought me... pages. Folded, not stapled. Or maybe they were. The words... they were lovely. Sad. Strong. It was raining, I think. Or maybe that was another day. She waited while I read. I remember her standing there. She didn’t talk much. I told her she was a writer. I’m sure of that. Or I hope I did. Something about her eyes. Quiet eyes. I wonder where she is now."
        }
    ]
}