{
    "name": "Jessica Marie Holloway",
    "start_deterioration_age": 75,
    "stories": [
        {
            "age": 60,
            "story": "It was a spring morning that started quiet and stayed kind. Mr. Ellis had passed two nights before, and his daughter called me to put the house right before the family came. I brought my small caddy—soap, linen spray, soft brush, cotton cloths. The rooms felt out of rhythm: cups in the sink, quilt folded but not smoothed, his shaving brush on the edge of the basin with lather dried like frost. I don’t rush a house like that. I wash the dishes in warm water and let them air-dry so the shine is honest, not loud. I make the bed with slow hands, pull the quilt, smooth the corners, press the line where his knees used to rest. In the bathroom I take the brush, soak it, work the old lather loose with my thumb until the bristles stand again like a small field. I wipe the mirror last, a light circle, so the room can see itself. When the daughter came in she stood very still, then let out a breath I’d heard before—the kind that says the weight can sit down now. She took my hand and said ‘steady.’ Not thank you. Not praise. Just steady. That word is the work. Not the shine. The quiet after."
        },
        {
            "age": 63,
            "story": "The day began soft—pale light, a cool kitchen. Mr. Ellis’s daughter asked me to prepare the house before people arrived. Grief shows itself in corners; I’ve learned to find it there. I cleared the sink, washed the cups, lined them on a towel and let them dry plain. I made the bed, pressed the quilt smooth, paused where I knew he used to sit while putting on socks. In the bathroom, the shaving brush waited under a thin coat of old lather. I soaked it, brushed it clean in slow circles, then stood it up to breathe. I kept the radio off. A house like that needs quiet to settle. By the time she returned, the rooms had shape again. She walked in and I heard the breath change, that small release. She said, ‘It feels steady.’ That’s better than perfect. Order doesn’t fix loss, but it holds it so the heart can touch it without breaking. That’s my kind of work."
        },
        {
            "age": 66,
            "story": "Morning. soft light through lace. The house felt thin without him, a little off key. I washed what was left in the sink, left the cups to dry on their own. I pulled the quilt tight and smoothed the dip his legs had taught the bed. The shaving brush had a crust of soap; I soaked and worked it until the bristles stood soft again. I wiped the counter, then the mirror. I use small words in my head when I do this: wash, fold, smooth, breathe. When his daughter came back, she didn’t cry. She just set her bag down and let out a long breath and said ‘steady’ like a prayer. I nodded. That’s the goal. Not new. Not shiny. Just steady enough to carry the day."
        },
        {
            "age": 69,
            "story": "Spring day. I came to set the house right after Mr. Ellis was gone. I always start with the sink because dishes collect the kind of worry that rattles. Warm water, a little soap, cups turned on a towel to dry standing. No forced shine, just clean. Bed next. I pulled the quilt, made the corners smooth, pressed the spot where his knees had taught the fabric to bend. In the bathroom, the old shaving brush waited with soap dried hard on it. I soaked it, worked the bristles with my thumb until they stood up soft again, then set it upright to breathe. I kept the radio off. A house like this has to find its breath again without noise. I wiped the mirror last so the room could see itself in order. When she came in, she stopped in the doorway and let out a long breath I’ve heard in other rooms. ‘Steady,’ she said. I remember that word more than her face or the time of day. It was enough. The room felt held, and that is the best I can give a family—held, not polished."
        },
        {
            "age": 72,
        "story": "Soft morning, quiet rooms. I washed the cups, made the bed, fixed the little brush. Slow steps. Warm water, small circles, cloth on the rim of each cup. Quilt pulled and smoothed until the corners lay flat and quiet. The brush had old soap on it; I soaked it and pressed with my thumb until the bristles stood again. No radio. No talk. A house like this needs time to find its breath. I moved room to room and said small words in my head: wash, fold, smooth, breathe. The place had been heavy, but then it wasn’t so heavy. When she came in—his girl—she stopped. I heard the breath change. ‘Steady,’ she said. Just that. Not thank you. Not pretty. Steady. That word sits with me. I keep it in my pocket when my hands get tired. Work like this is small, but it holds a lot. You don’t polish grief; you don’t try to shine it. You set it down in order so a person can touch it and not fall apart. That is enough for a day."
        },
        {
            "age": 75,
        "story": "Morning light. I did the cups, one by one. Warm water, slow hands. I set them on a towel to dry the honest way. I pulled the quilt smooth—hands at the corners, a small press where his knees had taught the cloth to bend. The little brush had old soap caught deep; I soaked it and rubbed until it felt soft again in my palm. I kept it quiet. I don’t turn on music on days like this. A room needs to hear itself first. She came in and stood still. The air changed. ‘Steady,’ she said. I keep that word. I say it to myself when I make a room right: steady… steady… steady. Simple word, strong back. Some pieces don’t stay in my head the way they used to, but this does. Wash, fold, smooth, breathe. Steady. It helps the day stand up and it helps me stand up too. I don’t need more than that. Quiet work. A room that can hold what it holds without breaking."
        }
    ]
}