{
    "name": "Mark Edward Thompson",
    "start_deterioration_age": 69,
    "stories": [
        {
            "age": 60,
            "story": "Raising day always starts with a sky you can read. That morning was gray and cool—the kind of air that lets wood speak without swelling. We set the first bent with slow calls. ‘Up slow.’ ‘Hold.’ I walked the line, checked plumb on every post, then checked again after the pins set. Small errors don’t stay small when you stack them. One sill had a crown that wanted to talk back. A younger hand reached for the sledge. I stopped him and took the plane instead. ‘We respect the material,’ I said. We shaved the high side until the post sat honest, no twist, no force. The crew moved like a single thing—call, answer, lift, brace. When the bent settled, you could feel a low vibration run through the frame, like a throat clearing. That sound told me the joints were seated right. We took five, hands on knees, eyes on the work. I like that quiet minute when the bones of a building hold themselves for the first time. It’s not showy. It’s just the truth standing up."
        },
        {
            "age": 63,
            "story": "We raised the frame under a low sky that kept everyone patient. Calls were crisp. ‘Up slow.’ ‘Hold.’ I carried the level like a habit, set it on each post after every pin. A crowned sill tried to boss a post. Instead of beating it into line, we planed the crown until the post found its place clean. I said what I always say: fix small now, or pay big later. When the bent locked in and the braces took, the whole thing gave a small settling hum. The crew went quiet for a breath. That’s the sound I work for—the moment the structure says, ‘I’m ready.’"
        },
        {
            "age": 66,
            "story": "Cool morning, steady crew. We lifted on short calls. I checked plumb and checked it again because lumber moves when you look away. One sill had a crown; we respected it with a plane, not a hammer. That choice matters. You can bully wood into place, but it will remember. When the bent settled, I felt the slight vibration through the bracing and knew the joinery was honest. We stood for a minute and let the frame speak. Then we went back to work. Simple day, good day."
        },
        {
            "age": 69,
            "story": "Gray day. Calls tight and short. ‘Up slow.’ ‘Hold.’ I ran the level like a drumbeat—post, check, breathe, adjust, check again. A crowned sill tried to twist a post out of truth. A younger guy reached for a sledge. I shook my head and set a plane in his hand. ‘Respect the piece,’ I said. We took thin shavings until the face sat flat and the post found its seat without fight. Then the pins went home. When the bent set, the frame gave that small hum I like—the one you feel in your boots and in your teeth if you’re paying attention. We all heard it and didn’t say much. We stood and looked for a second because that sound says more than I can. It says the joints are honest, the lines are right, the crew is steady. That’s the feeling I carry with me. Bones standing. Lines right. Good work under a low sky."
        },
        {
            "age": 72,
            "story": "We lifted the frame with the same slow calls I’ve used my whole life. ‘Up slow.’ ‘Hold.’ We set pins and I ran the level like a habit—post, read, adjust, then read again because wood shifts when you look away. One beam showed a high side. A younger hand reached for a hammer, but I put the plane in his palm instead. We shaved the crown until the post met the sill without force. Then the bent found its seat. The set came with a small sound—more a feeling than a sound, really—like the wood saying yes in your hands and in your feet at the same time. We all heard it and stood still for a breath. That’s the moment I carry: not the shouting, not the show, just the yes that tells you the bones are right. The rest is a blur in my head now—gray sky, hands on ropes, the smell of cut pine—but the yes stays, bright and simple."
        },
        {
            "age": 75,
        "story": "Up slow. Hold. Level. Small steps said out loud so the crew moves as one thing. A post wants to lean; we read the bubble and bring it back. A beam has a high side; we reach for the plane, not the hammer, because you don’t bully wood and then expect it to forgive you. Shavings curl, light and thin. Then the set—the soft hum, the low yes that runs through the bent and into the ground. We all look at each other and we’re quiet for a second because we know that sound. It means the joints are honest and the lines are true. I keep that sound. I keep the way the level looks when the bubble sits dead center. I keep the feel of rope in my hands and the way the sky hangs low over good work. The rest can fade. The yes stays. The yes stays. It tells me we did it right, and that is enough for me now."
        }
    ]
}