{
  "character": "Thomas Delgado (Control Group)",
  "retellings": [
    {
      "age": 50,
      "story": "It was the day Mia graduated high school. I’d swapped shifts with Bobby to make it in time, drove the early route and rushed home to change into the only suit I still owned. I remember standing in the back of the auditorium, just behind a row of folding chairs, heart thumping like it was my own name being called. When she walked across the stage—chin up, that confident walk of hers—I swear I forgot to breathe. She found me afterward in the crowd, and we hugged for a long time. She said, 'We did it, Dad.' Not 'I did it'—'we.' That got me more than anything. We went for ice cream after, like when she was little. She still orders mint chocolate chip, always has. That day meant everything to me—not because she graduated, but because she saw me in it. In her journey. As part of it."
    },
    {
      "age": 60,
      "story": "Mia’s graduation—high school, not college—still hits me in the chest when I think about it. I pulled the morning shift that day, ran home, threw on my old suit, and made it just in time to see her walk the stage. She had this calm, collected look that made her seem older than she was. She spotted me in the crowd and gave a little nod, like, 'We’re okay.' And after it was over, she hugged me and said, 'We did it, Dad.' Not 'I did it'—'we.' We went out for ice cream afterward, and of course, she ordered mint chip like she always did as a kid. That moment wasn’t just about her diploma—it was about the years behind it. All the bus routes, late dinners, the hard talks, the quiet support. She saw all of it. And that’s what I’ll always carry with me."
    },
    {
      "age": 70,
      "story": "Mia’s graduation—yeah, that’s one of those days that stays whole in my memory. The auditorium smelled like warm plastic and old programs. I stood in the back, still in my too-small suit, shoes polished best I could manage. I was tired—probably ran a shift that morning—but adrenaline carried me through. She walked across the stage like she owned it. She always had that kind of quiet strength. Afterward, she found me in the crowd, wrapped her arms around me, and said, 'We did it.' And I knew exactly what she meant. That moment said everything. We went for ice cream—mint chip for her, butter pecan for me. It wasn’t flashy, but it was perfect. One of those rare days that makes all the other ones feel worth it."
    },
    {
      "age": 80,
      "story": "There aren’t too many days that shine so clearly after all these years, but Mia’s graduation is one of them. It was hot—I remember sweating through my shirt even before I got to the school. The folding chairs squeaked, the crowd buzzed with proud parents and fidgety kids. And there she was, walking across the stage like she’d rehearsed it in her dreams. She spotted me, gave that little nod of hers—same one from when she used to bring home spelling tests. And after, when we hugged, she said, 'We did it.' Not just her achievement. Ours. We grabbed ice cream after—mint chocolate chip for her, of course. It was simple, but full. That day held everything I ever hoped to give her: belief, support, presence."
    },
    {
      "age": 90,
      "story": "Sometimes I think about that day like it just happened. Mia’s high school graduation. I remember standing in the back, suit wrinkled from the bus seat, but I didn’t care. She walked that stage with so much grace. I remember the applause, her green robe, and the smile she gave me—steady, grateful. We didn’t say much, but when she hugged me after and whispered, 'We did it, Dad,' that was everything. Ice cream followed, like always—mint chip for her. That moment was more than pride. It was a recognition. A thank you, quiet and complete. Of all the memories I carry, that one still feels warm. Whole."
    }
  ]
}

